; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared0 - mode
	thermograph2 - mode
	thermograph1 - mode
	image3 - mode
	GroundStation2 - direction
	Star8 - direction
	Star12 - direction
	GroundStation15 - direction
	Star21 - direction
	GroundStation22 - direction
	Star16 - direction
	Star11 - direction
	GroundStation18 - direction
	GroundStation6 - direction
	Star7 - direction
	Star23 - direction
	GroundStation13 - direction
	GroundStation19 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star24 - direction
	Star20 - direction
	Star3 - direction
	Star1 - direction
	Star9 - direction
	GroundStation10 - direction
	Star0 - direction
	GroundStation14 - direction
	Star17 - direction
	Phenomenon25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Planet28 - direction
	Phenomenon29 - direction
	Planet30 - direction
	Planet31 - direction
	Star32 - direction
	Star33 - direction
	Star34 - direction
	Planet35 - direction
	Planet36 - direction
	Star37 - direction
	Star38 - direction
	Star39 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation18)
	(calibration_target instrument0 Star17)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star20)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star23)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation18)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation14)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star20)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation19)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 Star23)
	(calibration_target instrument2 Star7)
	(supports instrument3 thermograph1)
	(supports instrument3 image3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star24)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon29)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star20)
	(supports instrument5 image3)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star17)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 Star9)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation13)
)
(:goal (and
	(pointing satellite0 GroundStation18)
	(pointing satellite2 Planet35)
	(have_image Phenomenon25 infrared0)
	(have_image Star26 thermograph2)
	(have_image Phenomenon27 thermograph1)
	(have_image Planet28 thermograph1)
	(have_image Phenomenon29 thermograph1)
	(have_image Planet30 image3)
	(have_image Planet31 image3)
	(have_image Star32 thermograph2)
	(have_image Star33 thermograph2)
	(have_image Star34 infrared0)
	(have_image Planet35 infrared0)
	(have_image Planet36 infrared0)
	(have_image Star37 thermograph2)
	(have_image Star38 thermograph2)
	(have_image Star39 image3)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 17
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 17
3. (turn_to satellite2 phenomenon25 groundstation13)
   deleted: (pointing satellite2 groundstation13)
   added: (pointing satellite2 phenomenon25)
   goals met: 0 of 17
4. (turn_to satellite1 planet30 phenomenon29)
   deleted: (pointing satellite1 phenomenon29)
   added: (pointing satellite1 planet30)
   goals met: 0 of 17
5. (turn_to satellite0 groundstation18 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 groundstation18)
   goals met: 1 of 17
6. (turn_to satellite2 star3 phenomenon25)
   deleted: (pointing satellite2 phenomenon25)
   added: (pointing satellite2 star3)
   goals met: 1 of 17
7. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 1 of 17
8. (turn_to satellite2 phenomenon25 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon25)
   goals met: 1 of 17
9. (take_image satellite2 phenomenon25 instrument4 infrared0)
   added: (have_image phenomenon25 infrared0)
   goals met: 2 of 17
10. (turn_to satellite2 phenomenon27 phenomenon25)
   deleted: (pointing satellite2 phenomenon25)
   added: (pointing satellite2 phenomenon27)
   goals met: 2 of 17
11. (take_image satellite2 phenomenon27 instrument4 thermograph1)
   added: (have_image phenomenon27 thermograph1)
   goals met: 3 of 17
12. (turn_to satellite2 phenomenon29 phenomenon27)
   deleted: (pointing satellite2 phenomenon27)
   added: (pointing satellite2 phenomenon29)
   goals met: 3 of 17
13. (take_image satellite2 phenomenon29 instrument4 thermograph1)
   added: (have_image phenomenon29 thermograph1)
   goals met: 4 of 17
14. (turn_to satellite2 planet28 phenomenon29)
   deleted: (pointing satellite2 phenomenon29)
   added: (pointing satellite2 planet28)
   goals met: 4 of 17
15. (take_image satellite2 planet28 instrument4 thermograph1)
   added: (have_image planet28 thermograph1)
   goals met: 5 of 17
16. (turn_to satellite2 planet35 planet28)
   deleted: (pointing satellite2 planet28)
   added: (pointing satellite2 planet35)
   goals met: 6 of 17
17. (take_image satellite2 planet35 instrument4 infrared0)
   added: (have_image planet35 infrared0)
   goals met: 7 of 17
18. (turn_to satellite2 planet36 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 planet36)
   goals met: 6 of 17
19. (take_image satellite2 planet36 instrument4 infrared0)
   added: (have_image planet36 infrared0)
   goals met: 7 of 17
20. (turn_to satellite2 planet35 planet36)
   deleted: (pointing satellite2 planet36)
   added: (pointing satellite2 planet35)
   goals met: 8 of 17
21. (turn_to satellite2 star26 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star26)
   goals met: 7 of 17
22. (take_image satellite2 star26 instrument4 thermograph2)
   added: (have_image star26 thermograph2)
   goals met: 8 of 17
23. (turn_to satellite2 planet35 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 planet35)
   goals met: 9 of 17
24. (turn_to satellite2 star32 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star32)
   goals met: 8 of 17
25. (take_image satellite2 star32 instrument4 thermograph2)
   added: (have_image star32 thermograph2)
   goals met: 9 of 17
26. (turn_to satellite2 planet35 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 planet35)
   goals met: 10 of 17
27. (turn_to satellite2 star33 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star33)
   goals met: 9 of 17
28. (take_image satellite2 star33 instrument4 thermograph2)
   added: (have_image star33 thermograph2)
   goals met: 10 of 17
29. (turn_to satellite2 planet35 star33)
   deleted: (pointing satellite2 star33)
   added: (pointing satellite2 planet35)
   goals met: 11 of 17
30. (turn_to satellite2 star34 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star34)
   goals met: 10 of 17
31. (take_image satellite2 star34 instrument4 infrared0)
   added: (have_image star34 infrared0)
   goals met: 11 of 17
32. (turn_to satellite2 planet35 star34)
   deleted: (pointing satellite2 star34)
   added: (pointing satellite2 planet35)
   goals met: 12 of 17
33. (turn_to satellite2 star37 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star37)
   goals met: 11 of 17
34. (take_image satellite2 star37 instrument4 thermograph2)
   added: (have_image star37 thermograph2)
   goals met: 12 of 17
35. (turn_to satellite2 planet35 star37)
   deleted: (pointing satellite2 star37)
   added: (pointing satellite2 planet35)
   goals met: 13 of 17
36. (turn_to satellite2 star38 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star38)
   goals met: 12 of 17
37. (take_image satellite2 star38 instrument4 thermograph2)
   added: (have_image star38 thermograph2)
   goals met: 13 of 17
38. (turn_to satellite2 planet35 star38)
   deleted: (pointing satellite2 star38)
   added: (pointing satellite2 planet35)
   goals met: 14 of 17
39. (turn_to satellite1 star23 planet30)
   deleted: (pointing satellite1 planet30)
   added: (pointing satellite1 star23)
   goals met: 14 of 17
40. (calibrate satellite1 instrument1 star23)
   added: (calibrated instrument1)
   goals met: 14 of 17
41. (turn_to satellite1 planet30 star23)
   deleted: (pointing satellite1 star23)
   added: (pointing satellite1 planet30)
   goals met: 14 of 17
42. (take_image satellite1 planet30 instrument1 image3)
   added: (have_image planet30 image3)
   goals met: 15 of 17
43. (turn_to satellite1 planet31 planet30)
   deleted: (pointing satellite1 planet30)
   added: (pointing satellite1 planet31)
   goals met: 15 of 17
44. (take_image satellite1 planet31 instrument1 image3)
   added: (have_image planet31 image3)
   goals met: 16 of 17
45. (turn_to satellite1 star39 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 star39)
   goals met: 16 of 17
46. (take_image satellite1 star39 instrument1 image3)
   added: (have_image star39 image3)
   goals met: 17 of 17
